# 4.6 Combining and Exporting Data

### Importing Libraries

In [1]:
# Importing libraries
import pandas as pd
import numpy as np
import os

### Importing data sets

In [2]:
# Creating path variable
path = r'C:\Users\lisa_\02\2023 Instacart Basket Analysis'

In [3]:
#Importing order_products_prior.csv
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

## 4.6.3 Import the orders_products_combined dataframe from the pickle file

In [4]:
# Import orders_products_combined.pkl
df_ords_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

## 4.6.4 Check the shape of the imported dataframe.

In [5]:
# Check shape
df_ords_combined.shape

(32434489, 11)

In [6]:
# Check output
df_ords_combined.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [7]:
# Drop first column
df_ords_combined = df_ords_combined.drop(df_ords_combined.columns[0], axis = 1)

In [8]:
# Check shape
df_ords_combined.shape

(32434489, 10)

In [9]:
# Check output
df_ords_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [10]:
# Check shape
df_prods.shape

(49672, 6)

In [11]:
# Check output
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [12]:
# Drop first column
df_prods = df_prods.drop(df_prods.columns[0], axis = 1)

In [13]:
# Check output
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [14]:
# Check shape
df_prods.shape

(49672, 5)

## 4.6.5 Determine a suitable way to combine the orders_products_combined dataframe with your products data set.

In [15]:
# Removing _merge column from df_ords_combined
df_ords_combined = df_ords_combined.drop(columns = ['_merge'])

In [16]:
# Check shape
df_ords_combined.shape

(32434489, 9)

In [17]:
# Merge df_ords_combined with df_prods
df_ords_merged = df_ords_combined.merge(df_prods, on = 'product_id', indicator = True)

In [18]:
# Check output
df_ords_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

## 4.6.6 Confirm the results of the merge using the merge flag.

In [19]:
# Check for full match
df_ords_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [20]:
df_ords_merged.shape

(32404859, 14)

## 4.6.7 Export the newly created dataframe as orders_products_merged in a suitable format.

In [21]:
# Export data to pkl
df_ords_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))